# config.py
import os
from dotenv import load_dotenv

load_dotenv()

BOT_TOKEN = os.getenv("BOT_TOKEN")
OWNER_ID = 7162454634  # <--- Твой ID (главный админ)
BOT_USERNAME = ""

# Список валют с кастомными эмодзи
CURRENCIES = {
    "USDT": {"emoji_id": "5280846677673010353", "emoji": "💎", "name": "Tether", "price_usd": 1.0},
    "GRAM": {"emoji_id": "5265151230790884988", "emoji": "💠", "name": "Gram", "price_usd": 1.31},
    "TON":  {"emoji_id": "5265151230790884988", "emoji": "💠", "name": "Toncoin", "price_usd": 5.50},
    "SOL":  {"emoji_id": "5280476129369543392", "emoji": "🟣", "name": "Solana", "price_usd": 104.25},
    "TRX":  {"emoji_id": "5274031466517377092", "emoji": "🔴", "name": "TRON", "price_usd": 0.3294},
    "BTC":  {"emoji_id": "5280624271381520811", "emoji": "🟠", "name": "Bitcoin", "price_usd": 81002.15},
    "ETH":  {"emoji_id": "5280613443768967293", "emoji": "🔵", "name": "Ethereum", "price_usd": 2396.72},
    "DOGE": {"emoji_id": "5285358914479609357", "emoji": "🟡", "name": "Dogecoin", "price_usd": 0.07993},
    "LTC":  {"emoji_id": "5273967072072706245", "emoji": "🔷", "name": "Litecoin", "price_usd": 58.08},
    "BNB":  {"emoji_id": "5280907155107506256", "emoji": "🟡", "name": "Binance Coin", "price_usd": 746.18},
    "USDC": {"emoji_id": "5465379230286093848", "emoji": "🔵", "name": "USD Coin", "price_usd": 0.9996},
    "XAUT": {"emoji_id": "5274109686461786158", "emoji": "🟡", "name": "Tether Gold", "price_usd": 3999.51},
}

# Фиатные валюты для P2P
FIAT_CURRENCIES = [
    "RUB", "USD", "EUR", "BYN", "UAH", "KZT", "UZS", "GEL", "TRY",
    "AMD", "THB", "INR", "BRL", "IDR", "AZN", "AED", "PLN", "ILS",
    "KGS", "TJS", "LKR", "MDL"
]

FIAT_FLAGS = {
    "RUB": "🇷🇺", "USD": "🇺🇸", "EUR": "🇪🇺", "BYN": "🇧🇾", "UAH": "🇺🇦",
    "KZT": "🇰🇿", "UZS": "🇺🇿", "GEL": "🇬🇪", "TRY": "🇹🇷", "AMD": "🇦🇲",
    "THB": "🇹🇭", "INR": "🇮🇳", "BRL": "🇧🇷", "IDR": "🇮🇩", "AZN": "🇦🇿",
    "AED": "🇦🇪", "PLN": "🇵🇱", "ILS": "🇮🇱", "KGS": "🇰🇬", "TJS": "🇹🇯",
    "LKR": "🇱🇰", "MDL": "🇲🇩"
}

EMOJI = {
    "crypto": "5361914370068613491", "wallet": "5310191758255099001", "pay": "5361543877599724417",
    "gift": "5361986358015463601", "bulb": "5362084755716214813", "arrows_cycle": "5312212278374861302",
    "shop": "5361781191722699867", "cup": "5361767787129766930", "premium": "5362006552951690043",
    "unknown1": "5361692603727252420", "home_dollar": "5312419154064607942", "arrows_diff": "5361993818373655559",
    "gift_bulb": "5364047422626500018", "sbp": "5363972466857252756", "home_orange": "5312419154064607942",
    "home_green": "5312419154064607942", "megaphone": "5312161417372142817", "unknown3": "5312419154064607942",
    "arrows_cycle2": "5312212278374861302", "check_btn": "5311998535032409760", "invoice_btn": "5312043357311111246",
    "dollar": "5309795500277403547", "support": "5312365458383474419", "settings": "5309974037772928528",
    "message": "5312103894875143512", "card": "5312057711091813718", "verified": "5312326644764018054",
    "diamond_check": "5309762875705823313", "arrows_up": "5312014881677934423", "qr": "5309771942381785364",
    "danger": "5319034842514499001", "aml": "5318822061244716022", "arrow_down": "5318862055980177086",
    "arrow_up": "5319073291061730002", "ban": "5319096054388401002", "heart_broken": "5318859418870258003",
    "dislike": "5321127775782870841", "fake": "5321145226234993332", "kyc": "5319204107175631682",
    "lightning": "5318810984524060823", "like": "5319185724715606087", "minus": "5319260826513742496",
    "new": "5318817040427949274", "plus": "5318863168376709909", "premium_clean": "5319069159303194146",
    "heart_purple": "5319000753359065895", "heart_red": "5319062772686823000", "scam": "5318908072259787465",
    "leaf": "5253944419870062295",
    # 54 Белых кастомных эмодзи
    "tg_logo": "5875465628285931233",
    "tg_star": "5958376256788502078",
    "tg_star_falling": "5931621672846103580",
    "gift_box": "6032937473162614352",
    "arrow_up_white": "5875078273775439450",
    "arrow_down_white": "5875008416132370818",
    "arrow_share": "5832251986635920010",
    "url_link": "5884343982816759327",
    "arrow_updown": "5874986954180791957",
    "download": "5879883461711367869",
    "search": "5874960879434338403",
    "check": "5825794181183836432",
    "dots_vert": "5877219383691972108",
    "dots_horiz": "5875019892284985369",
    "paperclip": "5877495434124988415",
    "at_sign": "5771887475421090729",
    "keyboard": "5877396173135811032",
    "doc_file": "5875206779196935950",
    "sim_card": "5877316724830768997",
    "computer": "5967816500415827773",
    "folder": "5877332341331857066",
    "tag_label": "5987802868734760945",
    "favorites": "5843843420468024653",
    "trash": "5879896690210639947",
    "copy": "5877301185639091664",
    "pencil": "5879841310902324730",
    "exit": "5877341274863832725",
    "profile_circle": "5879770735999717115",
    "arrows_cycle_white": "5877410604225924969",
    "info_circle": "5879785854284599288",
    "check_circle": "5776375003280838798",
    "cross_circle": "5778527486270770928",
    "timer": "5960751816084820359",
    "internet": "5879585266426973039",
    "danger_white": "5881702736843511327",
    "shield_exclamation": "5775887550262546277",
    "shield_check": "5931409969613116639",
    "lock_closed": "5879895758202735862",
    "lock_open": "6034962180875490251",
    "key": "6005570495603282482",
    "pin": "5796440171364749940",
    "fingerprint": "5886505193180239900",
    "sound_on": "5890997763331591703",
    "sound_off": "5890838600433536921",
    "photo": "5775949822993371030",
    "robot": "5931415565955503486",
    "wrench": "5988023995125993550",
    "gear": "5967574255670399788",
    "briefcase": "5967389567781703494",
    "verify_check": "5951665890079544884",
    "id_card": "5936017305585586269",
    "shop_market": "5983399041197675256",
    "crown": "5807868868886009920",
    "diamond_white": "6028530359975548369"
}

def _e(key: str, fallback: str) -> str:
    emoji_id = EMOJI.get(key)
    if not emoji_id:
        return fallback
    return f'<tg-emoji emoji-id="{emoji_id}">{fallback}</tg-emoji>'